app/controllers/geofences_controller.rb

SELECT "geofences".* FROM "geofences"
---
  def index
    @geofences = Geofence.all

INSERT INTO "geofences" ("alarm", "created_at", "updated_at", "user_id", "x_act", "x_al", "y_act", "y_al") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["alarm", "f"], ["created_at", "2014-06-05 03:04:50.221930"], ["updated_at", "2014-06-05 03:04:50.221930"], ["user_id", 1], ["x_act", 30.012], ["x_al", 30.01], ["y_act", 52.012], ["y_al", 50.03]]
---
  def create
    @geofence = Geofence.new(geofence_params)

    respond_to do |format|
      if @geofence.save

SELECT  "geofences".* FROM "geofences"  WHERE "geofences"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_geofence
      @geofence = Geofence.find(params[:id])